
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СимволРазделитель=";";
	НачальныйНомерСтроки="1";
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыOK(Команда)
	Закрыть(Новый Структура("СимволРазделитель, НачальныйНомерСтроки", СимволРазделитель, НачальныйНомерСтроки));
КонецПроцедуры

&НаКлиенте
Процедура НачальныйНомерСтрокиПриИзменении(Элемент)
	НачальныйНомерСтроки=Макс(НачальныйНомерСтроки, 1);
КонецПроцедуры

&НаКлиенте
Процедура СимволРазделительПриИзменении(Элемент)
	СимволРазделитель=?(ПустаяСтрока(СимволРазделитель),";",СимволРазделитель);
КонецПроцедуры
