// -----------------------------------------------------------
// Appius-PLM Управление жизненным циклом изделия
// -----------------------------------------------------------
// Разработка ГК АППИУС, www.appius.ru
// -------------------------------------
// Импорт из внешних источников.
// -----------------------------------------------
// Данное программное обеспечение не является бесплатным.
// -----------------------------------------------

Перем ОписаниеТиповЯчейки;
Перем ОписаниеТиповЯчейкиУровня;

Функция plm_ПодборЭлементовПоСвойствам( мсЗначенияСвойств ) Экспорт
	Если мсЗначенияСвойств.Количество() = 0 Тогда 
		ВозвМассив = Новый Массив;
		Возврат ВозвМассив; 
	КонецЕсли;
	
	ЗапросЭлементов = Новый Запрос;
	ЗапросЭлементов.Текст = "ВЫБРАТЬ
	                        |	ЗначенияПараметров.ЭлементСсылка КАК ЭлементСсылка
	                        |ИЗ
	                        |	(ВЫБРАТЬ
	                        |		plm_ЭлементыСтруктурыПараметры.Ссылка КАК ЭлементСсылка,
	                        |		ВЫРАЗИТЬ(plm_ПараметрыЭлементов.Значение КАК СТРОКА(1024)) КАК ЗначениеПараметраСтрокой
	                        |	ИЗ
	                        |		Справочник.plm_ЭлементыСтруктуры КАК plm_ЭлементыСтруктуры
	                        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.plm_ЭлементыСтруктуры.Параметры КАК plm_ЭлементыСтруктурыПараметры
	                        |			ПО plm_ЭлементыСтруктуры.Ссылка = plm_ЭлементыСтруктурыПараметры.Ссылка
	                        |				И (НЕ plm_ЭлементыСтруктуры.ПометкаУдаления)
	                        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.plm_ПараметрыЭлементов КАК plm_ПараметрыЭлементов
	                        |			ПО (plm_ЭлементыСтруктурыПараметры.Параметр = plm_ПараметрыЭлементов.Ссылка)
	                        |				И (plm_ПараметрыЭлементов.Значение <> НЕОПРЕДЕЛЕНО)) КАК ЗначенияПараметров";
	Для j = 0 По мсЗначенияСвойств.ВГраница() Цикл 
		Если j = 0 Тогда 
			ЗапросЭлементов.Текст = ЗапросЭлементов.Текст + "
							|ГДЕ
							|	";
		Иначе
			ЗапросЭлементов.Текст = ЗапросЭлементов.Текст + "
							|	ИЛИ ";
		КонецЕсли;
		ЗапросЭлементов.Текст = ЗапросЭлементов.Текст + "ЗначениеПараметраСтрокой = ВЫРАЗИТЬ(&Значение" + Строка(j) + " КАК СТРОКА(1024))";
		ЗапросЭлементов.УстановитьПараметр("Значение" + Строка(j), мсЗначенияСвойств[j]);
	КонецЦикла;
	ЗапросЭлементов.Текст = ЗапросЭлементов.Текст + "
							|
							|СГРУППИРОВАТЬ ПО
							|	ЭлементСсылка
							|
							|ИМЕЮЩИЕ
							|	КОЛИЧЕСТВО(ЗначениеПараметраСтрокой) >= &КоличествоСвойств";
	ЗапросЭлементов.УстановитьПараметр("КоличествоСвойств", мсЗначенияСвойств.Количество());
	Возврат ЗапросЭлементов.Выполнить().Выгрузить();
КонецФункции

Функция РазборСтрокиТекстовогоДокумента( Знач Строка, СимволРазделитель ) Экспорт
	ВозвМассив=Новый Массив();
	Пока СтрДлина(Строка)>0 Цикл 
		i=Найти(Строка,СимволРазделитель);
		Знч=?(i>0, Лев(Строка,i-1), Строка);
		Знч=СтрЗаменить(Знч,"""","");
		ВозвМассив.Добавить(Знч);
		Строка=?(i>0, Сред(Строка,i+1), "");
	КонецЦикла;
	Возврат ВозвМассив;
КонецФункции

Процедура ПрочитатьДанныеBOM( ТабДок, ТДокумент, Прогресс, ПараметрыЧтения ) Экспорт
	ТабДок.Очистить();
	
	// уровень
	ОбластьКолонки = ТабДок.Область(0,1,0,1);
	ОбластьКолонки.ШиринаКолонки = 5;
	// вид элемента	
	ОбластьКолонки = ТабДок.Область(0,2,0,2);
	ОбластьКолонки.ШиринаКолонки = 20;
	
	//Прогресс.МаксимальноеЗначение=ТДокумент.КоличествоСтрок();
	//Прогресс.МинимальноеЗначение=1;
	
	Для i=1 По ТДокумент.КоличествоСтрок() Цикл
		//Прогресс.Значение=i;
		
		ЗаполнитьОбластьУровня(ТабДок.Область(i,1,i,1), 1);
		
		СтрокаТДокумента=ТДокумент.ПолучитьСтроку(i+ПараметрыЧтения.НачальныйНомерСтроки-1);
		
		МассивЗначений=РазборСтрокиТекстовогоДокумента(СтрокаТДокумента, ПараметрыЧтения.СимволРазделитель);
		Для j=1 По МассивЗначений.Количество() Цикл
			ОбластьЯчейки = ТабДок.Область(i,j+2,i,j+2);
			ОбластьЯчейки.Текст = МассивЗначений[j-1];
			
			ЗаполнитьОбласть(ТабДок.Область(i,2,i,2), Справочники.plm_ВидыЭлементов.ПустаяСсылка());
		КонецЦикла;
	КонецЦикла;
	
	//Прогресс.Значение=0;
КонецПроцедуры

Процедура ПрочитатьДанныеEXCEL( ТабДок, ExcelЛист, Прогресс, СтруктураНастроек ) Экспорт 
	ТабДок.Очистить();
	
	// уровень
	ОбластьКолонки = ТабДок.Область(0,1,0,1);
	ОбластьКолонки.ШиринаКолонки = 5;
	// вид элемента	
	ОбластьКолонки = ТабДок.Область(0,2,0,2);
	ОбластьКолонки.ШиринаКолонки = 20;
	
	xlCellTypeLastCell = 11;
	Rows = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
	Cols = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
	
	
	//Прогресс.МаксимальноеЗначение=Rows;
	//Прогресс.МинимальноеЗначение=1;
	текущийОтступ=1;
	Для i=1 По Rows Цикл 
		//Прогресс.Значение=i;
		outLineLevel=ExcelЛист.Rows(i).OutlineLevel;
		Если outLineLevel>текущийОтступ Тогда
			ТабДок.НачатьГруппуСтрок();
			текущийОтступ=outLineLevel;
		ИначеЕсли outLineLevel<текущийОтступ Тогда
			ТабДок.ЗакончитьГруппуСтрок();
    		текущийОтступ=outLineLevel;
		КонецЕсли;
		
        ЗаполнитьОбластьУровня(ТабДок.Область(i,1,i,1), текущийОтступ);

		Для j=1 По Cols Цикл 
			ОбластьКолонки = ТабДок.Область(0,j+2,0,j+2);
			ОбластьКолонки.ШиринаКолонки = ExcelЛист.Columns(j).ColumnWidth;
			ОбластьЯчейки = ТабДок.Область(i,j+2,i,j+2);
			ОбластьЯчейки.Текст = ExcelЛист.Cells(i,j).Value;
		КонецЦикла;
		ЗаполнитьОбласть(ТабДок.Область(i,2,i,2), Справочники.plm_ВидыЭлементов.ПустаяСсылка());
	КонецЦикла;
	
	//Прогресс.Значение=0;
КонецПроцедуры

Процедура ЗаписатьДанныеEXCEL(ТабДок, МассивСтрок) Экспорт
	ТабДок.Очистить();
	
	// уровень
	ОбластьКолонки = ТабДок.Область(0,1,0,1);
	ОбластьКолонки.ШиринаКолонки = 5;
	// вид элемента	
	ОбластьКолонки = ТабДок.Область(0,2,0,2);
	ОбластьКолонки.ШиринаКолонки = 20;
	
	текущийОтступ=1;
	Для i=1 По МассивСтрок.Количество() Цикл
		ТекСтрока = МассивСтрок[i-1];
		
		Если ТекСтрока.outLineLevel>текущийОтступ Тогда
			ТабДок.НачатьГруппуСтрок();
			текущийОтступ=ТекСтрока.outLineLevel;
		ИначеЕсли ТекСтрока.outLineLevel<текущийОтступ Тогда
			ТабДок.ЗакончитьГруппуСтрок();
			текущийОтступ=ТекСтрока.outLineLevel;
		КонецЕсли;
		
		ЗаполнитьОбластьУровня(ТабДок.Область(i,1,i,1), текущийОтступ);
		
		Для j=1 По ТекСтрока.Cols.Количество() Цикл
			ОбластьКолонки = ТабДок.Область(0,j+2,0,j+2);
			ОбластьКолонки.ШиринаКолонки = ТекСтрока.ColumnWidth[j-1];
			ОбластьЯчейки = ТабДок.Область(i,j+2,i,j+2);
			ОбластьЯчейки.Текст = ТекСтрока.Cols[j-1];
		КонецЦикла;
		
		ЗаполнитьОбласть(ТабДок.Область(i,2,i,2), ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПустаяСсылка"));
	КонецЦикла;
КонецПроцедуры

Функция ЗаполнитьОбласть(Область, Знч) Экспорт 
	Область.СодержитЗначение=Истина;
	Область.ТипЗначения=ОписаниеТиповЯчейки;    
	Область.Значение=Знч;
	//Область.ЭлементУправления.КнопкаВыбора=Истина;
	//Область.ЭлементУправления.КнопкаОчистки=Истина;
	//Область.ЭлементУправления.ВыбиратьТип=Ложь;
	Область.ЦветФона=ЦветаСтиля.ЦветФонаКнопки;
КонецФункции

Функция ЗаполнитьОбластьУровня(Область, Знч) Экспорт 
	Область.СодержитЗначение=Истина;
	Область.ТипЗначения=ОписаниеТиповЯчейкиУровня;
	Область.Значение=Знч;
	Область.ЦветФона=ЦветаСтиля.ЦветФонаКнопки;
КонецФункции


// Процедура импортирует данные из внешнего источника в режиме рабочей копии
// Параметры:
//		parentXDTO - объект модели XDTO
//		ТаблицаИмпорта - ТаблицаЗначений, таблица данных импорта
//		ТаблицаКолонокСпецификации - ТаблицаЗначений, таблица колонок спецификации
Процедура plm_ИмпортДанныхСпецификации( parentXDTO, ТаблицаИмпорта, ТаблицаКолонокСпецификации, ФормаПриемник = Неопределено ) Экспорт 
	ФлагПроверкиУникальности=(ПараметрыСеанса.plm_ПроверкаУникальностиВключена=Истина 
								И Константы.plm_ПроверкаУникальности.Получить()=Истина);

	
	ТаблицаКолонокСпецификации.Сортировать("ВидЭлемента");
	ТаблицаРазличныхВидов = ТаблицаКолонокСпецификации.Скопировать();
	ТаблицаРазличныхВидов.Свернуть("ВидЭлемента");
	МассивРазличныхВидов = ТаблицаРазличныхВидов.ВыгрузитьКолонку("ВидЭлемента");
	СоответствиеВидовИКолонок = Новый Соответствие;
	Для Каждого Видссылка Из МассивРазличныхВидов Цикл 
		СоответствиеВидовИКолонок.Вставить(Видссылка, ТаблицаКолонокСпецификации.Скопировать(Новый Структура("ВидЭлемента, Видимость", Видссылка, Истина)));
	КонецЦикла;
	
	
	//ТаблицаКолонок=ТаблицаКолонокСпецификации.Скопировать(Новый Структура("ВидЭлемента",parentXDTO.elementType));
	//Если ТаблицаКолонок.Количество()=0 Тогда 
	//	ТаблицаКолонок=ТаблицаКолонокСпецификации.Скопировать(Новый Структура("ВидЭлемента",Справочники.plm_ВидыЭлементов.ПустаяСсылка()));
	//КонецЕсли;
	//Если ТаблицаКолонок.Колонки.Найти("Видимость") <> Неопределено Тогда 
	//	j=0;
	//	Пока j<ТаблицаКолонок.Количество() Цикл 
	//		Если ТаблицаКолонок[j].Видимость<>Истина Тогда 
	//			ТаблицаКолонок.Удалить(j); Продолжить;
	//		КонецЕсли;
	//		j=j+1;
	//	КонецЦикла;
	//КонецЕсли;
	ПроверятьПринадлежностьСвойства = (ТаблицаКолонокСпецификации.Колонки.Найти("Принадлежность")<>Неопределено);
	НаличиеКолонокЕдиницИзмерения = (ТаблицаКолонокСпецификации.Колонки.Найти("ЕдиницыИзмерения")<>Неопределено И ТаблицаКолонокСпецификации.Найти(Истина,"ЕдиницыИзмерения")<>Неопределено);
	
	МассивРодителей=Новый Массив();
	МассивРодителей.Добавить( ?(ЗагружатьВКорень, Неопределено, parentXDTO) );
	
	МассивКорнСтрок = Новый Массив;
	
	СоответствиеСуществующихЭлементовИXDTO = Новый Соответствие;
	МассивНеобрабатываемыхРодителейXDTO = Новый Массив;
	
	ДеревоСвойствСвязиОбразец = plm_ПолучитьДеревоСвойств(Справочники.plm_ВидыЭлементов.СвязьСостава);
	СоответствиеВидовЭлементовИДеревьевСвойств = Новый Соответствие;
	
	СоответствиеВидовЭлементовИСтрокЗначений = Новый Соответствие;
	
	Если Метаданные.Справочники.Найти("УпаковкиЕдиницыИзмерения") <> Неопределено Тогда 
		ОписаниеТиповЕдИзм = Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения");
	Иначе 
		ОписаниеТиповЕдИзм = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
	КонецЕсли;
	Если НЕ ЗагружатьСоставИзделия Тогда 
		// шаблоны тех. связей для поиска по видам элементов
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	plm_ШаблоныТехнологическихСвязейВидыЭлементов.ВидЭлемента,
		                    |	plm_ШаблоныТехнологическихСвязейПодчиненныеВидыЭлементов.ВидЭлемента КАК ВидЭлементаПотомок,
		                    |	plm_ШаблоныТехнологическихСвязейВидыЭлементов.Ссылка,
		                    |	plm_ШаблоныТехнологическихСвязейВидыЭлементов.Ссылка.ГоризонтальнаяСвязь КАК ГоризонтальнаяСвязь
		                    |ИЗ
		                    |	Справочник.plm_ШаблоныТехнологическихСвязей.ВидыЭлементов КАК plm_ШаблоныТехнологическихСвязейВидыЭлементов
		                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.plm_ШаблоныТехнологическихСвязей.ПодчиненныеВидыЭлементов КАК plm_ШаблоныТехнологическихСвязейПодчиненныеВидыЭлементов
		                    |		ПО plm_ШаблоныТехнологическихСвязейВидыЭлементов.Ссылка = plm_ШаблоныТехнологическихСвязейПодчиненныеВидыЭлементов.Ссылка
		                    |ГДЕ
		                    |	НЕ plm_ШаблоныТехнологическихСвязейВидыЭлементов.ВидЭлемента.ПометкаУдаления
		                    |	И НЕ plm_ШаблоныТехнологическихСвязейПодчиненныеВидыЭлементов.ВидЭлемента.ПометкаУдаления
		                    |	И НЕ plm_ШаблоныТехнологическихСвязейПодчиненныеВидыЭлементов.Ссылка.Служебный
		                    |	И НЕ plm_ШаблоныТехнологическихСвязейПодчиненныеВидыЭлементов.Ссылка.КонтекстнаяСвязь
		                    |
		                    |УПОРЯДОЧИТЬ ПО
		                    |	plm_ШаблоныТехнологическихСвязейВидыЭлементов.Ссылка.Код");
		ТЗВидовЭлементовИШаблоновСвязей=Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	МассивСообщений = Новый Массив;

	
	itemXDTO=Неопределено;
	ТекущийУровень=1;
	Для i=0 По ТаблицаИмпорта.Количество()-1 Цикл 
		СтрокаИмпорта=ТаблицаИмпорта[i];
		Если СтрокаИмпорта.Уровень=0 Тогда 
			СтрокаИмпорта.Уровень=1;
		КонецЕсли;
		
		Если СтрокаИмпорта.Уровень>ТекущийУровень И i>0 Тогда
			МассивРодителей.Добавить( itemXDTO );
			ТекущийУровень=ТекущийУровень+1;
		ИначеЕсли СтрокаИмпорта.Уровень<ТекущийУровень Тогда
			РазницаУровней=ТекущийУровень-СтрокаИмпорта.Уровень;
			Для k=1 По РазницаУровней Цикл 
				МассивРодителей.Удалить(МассивРодителей.Количество()-1);
			КонецЦикла;
			ТекущийУровень=ТекущийУровень-РазницаУровней;
		КонецЕсли;
		
		currentParentXDTO=МассивРодителей[МассивРодителей.Количество()-1];
		Если МассивНеобрабатываемыхРодителейXDTO.Найти(currentParentXDTO)<>Неопределено Тогда 
			Продолжить; 
		КонецЕсли;
		
		ТаблицаКолонок = СоответствиеВидовИКолонок.Получить(?(currentParentXDTO=Неопределено, Справочники.plm_ВидыЭлементов.ПустаяСсылка(), currentParentXDTO.elementType));
		Если ТаблицаКолонок = Неопределено Тогда 
			ТаблицаКолонок = СоответствиеВидовИКолонок.Получить(Справочники.plm_ВидыЭлементов.ПустаяСсылка());
		КонецЕсли;
		
		
		// первая колонка всегда ВидЭлемента
		ВидЭлементаИмпорта = СтрокаИмпорта.ВидЭлемента; НайденныеСвойства = Новый Массив();
		
		Если ТипЗнч(ВидЭлементаИмпорта)<>Тип("СправочникСсылка.plm_ВидыЭлементов") Тогда 
			itemXDTO = plm_СоздатьОбъектМоделиXDTO(ВидЭлементаИмпорта);
		Иначе
			itemXDTO = Неопределено;
			
			ДеревоСвойствОбразец = СоответствиеВидовЭлементовИДеревьевСвойств[ВидЭлементаИмпорта];
			Если ДеревоСвойствОбразец = Неопределено Тогда 
				ДеревоСвойствОбразец = plm_ПолучитьДеревоСвойств(ВидЭлементаИмпорта);
				СоответствиеВидовЭлементовИДеревьевСвойств.Вставить(ВидЭлементаИмпорта, ДеревоСвойствОбразец);
			КонецЕсли;
			ДеревоСвойств = ДеревоСвойствОбразец.Скопировать();
			
			СтрокаЗначенийЭлемента = "";
			///////////////////////////////////////////////////////
			// заполнение значений дерева свойств по таблице (для элемента)
			СтрокиДереваСвойств=ДеревоСвойств.Строки.НайтиСтроки(Новый Структура("ЭтоГруппа", Ложь), Истина);
			Для Каждого СтрокаДереваСвойств Из СтрокиДереваСвойств Цикл 
				КолонкаСпецификации = ТаблицаКолонок.Найти(СтрокаДереваСвойств.Свойство);
				Если КолонкаСпецификации <> Неопределено 
						И (НЕ ПроверятьПринадлежностьСвойства Или КолонкаСпецификации.Принадлежность <> 2) Тогда 
					ИндексКолонки = ТаблицаКолонок.Индекс(КолонкаСпецификации);
					Если НаличиеКолонокЕдиницИзмерения Тогда 
						Для инд=0 По ТаблицаКолонок.Индекс(КолонкаСпецификации)-1 Цикл 
							Если ТаблицаКолонок[инд].ЕдиницыИзмерения = Истина Тогда 
								ИндексКолонки = ИндексКолонки + 1;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					Если ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
						ТипЗначенияСвойства = СтрокаДереваСвойств.Свойство.ТипЗначения;
						ЗначениеПараметра = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ТипЗначенияСвойства);
						//Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда 
							СтрокаДереваСвойств.Значение = ЗначениеПараметра;
						//КонецЕсли;
						ИндексКолонки=ИндексКолонки+1; // единицы измерения
						Если КолонкаСпецификации.ЕдиницыИзмерения И ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
							СтрокаДереваСвойств.ЕдиницаИзмерения = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ОписаниеТиповЕдИзм);
						КонецЕсли;
						
						ЗначениеПараметраСтрокой = Строка(ЗначениеПараметра);
						СтрокаЗначенийЭлемента = СтрокаЗначенийЭлемента+?(ПустаяСтрока(СтрокаЗначенийЭлемента),""," ")+ЗначениеПараметраСтрокой;
					КонецЕсли;
					
					НайденныеСвойства.Добавить(СтрокаДереваСвойств.Свойство);
				КонецЕсли; // Если КолонкаСпецификации <> Неопределено Тогда 
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ВидЭлементаИмпорта.НастройкаПроверкиУникальности) Тогда 
				// ищем существующий заранее по значениям колонок (без стандартной проверки уникальности)
				СоответствиеСтрокЗначенийИЭлементов = СоответствиеВидовЭлементовИСтрокЗначений[ВидЭлементаИмпорта];
				Если СоответствиеСтрокЗначенийИЭлементов = Неопределено Тогда 
					СоответствиеСтрокЗначенийИЭлементов = Новый Соответствие;
					СоответствиеВидовЭлементовИСтрокЗначений.Вставить(ВидЭлементаИмпорта, СоответствиеСтрокЗначенийИЭлементов);
				КонецЕсли;
				itemXDTOОбразец = СоответствиеСтрокЗначенийИЭлементов[СтрокаЗначенийЭлемента];
				Если itemXDTOОбразец <> Неопределено Тогда 
					//itemXDTO = Строка2XDTO(itemXDTOОбразец);
					itemXDTO = plm_СкопироватьОбъектМоделиXDTO(itemXDTOОбразец);
					itemXDTO.link = Неопределено;
					itemXDTO.linkType = Неопределено;
					// удалить параметры связи из модели XDTO
					plm_УдалитьИзМассиваXDTO(itemXDTO.parameters, Новый Структура("linkParameter", Истина));

					// считаем, что элемент уже загружен
					МассивНеобрабатываемыхРодителейXDTO.Добавить(itemXDTO);
				КонецЕсли;
			КонецЕсли;
			
			Если itemXDTO = Неопределено Тогда 
				НачатьТранзакцию();
				
				СуществующийЭлемент = Неопределено;
				Попытка
					НовыйЭлементСтруктуры = Обработки.plm_СозданиеОбъектов.plm_СозданиеОбъекта(ВидЭлементаИмпорта, ДеревоСвойств,, Истина);
					НовыйЭлементСтруктуры.Наименование = Обработки.plm_СозданиеОбъектов.plm_ФормированиеНаименованияЭлемента( НовыйЭлементСтруктуры );
					Если ФлагПроверкиУникальности Тогда 
						СуществующиеЭлементы = plm_ЗапросыСервер.plm_ПроверкаУникальности(Object1С2Строка(НовыйЭлементСтруктуры));
					КонецЕсли;
					Если ФлагПроверкиУникальности И СуществующиеЭлементы.Количество() > 0 Тогда 
						СуществующийЭлемент = СуществующиеЭлементы[0].ЭлементСсылка;
						ВызватьИсключение НСтр("ru = 'Элемент <'; en_US = 'The <'")+НовыйЭлементСтруктуры.Наименование+НСтр("ru = '> не уникален!'; en_US = '> is not unique!'")+" "+НСтр("ru = 'Существующий элемент: <'; en_US = 'The existing item: <'")+Строка(СуществующиеЭлементы[0].ЭлементСсылка)+">.";
					Иначе 
						НовыйЭлементСтруктуры.ДополнительныеСвойства.Вставить("ПроверитьУникальность", Ложь);
						НовыйЭлементСтруктуры.Записать();
						
						itemXDTO = plm_СоздатьОбъектМоделиXDTO(НовыйЭлементСтруктуры.Ссылка);
						itemXDTO.created  = Истина;
						itemXDTO.modified = Истина;
						ОтменитьТранзакцию();
					КонецЕсли;
				Исключение 
					Если ТранзакцияАктивна() Тогда 
						ОтменитьТранзакцию();
					КонецЕсли;
					Если СуществующийЭлемент <> Неопределено Тогда 
						Если СоответствиеСуществующихЭлементовИXDTO.Получить(СуществующийЭлемент)=Неопределено Тогда 
							itemXDTO = plm_СоздатьОбъектМоделиXDTO( СуществующийЭлемент );
							// проверяем, если ли строки уровнем ниже в таблице импорта
							Если i+1<ТаблицаИмпорта.Количество() И ТаблицаИмпорта[i+1].Уровень>ТекущийУровень Тогда 
								Если ИзменятьСоставСуществующих = 0 Тогда 
									// не изменять
									МассивНеобрабатываемыхРодителейXDTO.Добавить(itemXDTO);
								Иначе 
									Обработки.plm_Проводник.plm_ОбновитьМодельXDTO(itemXDTO);
									Если ИзменятьСоставСуществующих = 1 Тогда 
										// помечаем на удаление старый состав
										Для Каждого childItemXDTO Из itemXDTO.items Цикл 
											Если childItemXDTO.linkType = Перечисления.plm_ВидыВертикальныхСвязей.СоставИзделия Тогда 
												childItemXDTO.deleted = Истина;
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
								СоответствиеСуществующихЭлементовИXDTO.Вставить(СуществующийЭлемент, itemXDTO);
							КонецЕсли;							
						Иначе 
							itemXDTO = plm_СоздатьОбъектМоделиXDTO( СуществующийЭлемент );
							МассивНеобрабатываемыхРодителейXDTO.Добавить(itemXDTO);
						КонецЕсли;
					Иначе // другая ошибка
						Сообщить(ПараметрыСеанса.plm_ПрефиксСлужебныхСообщений+НСтр("ru = ""Не удалось импортировать элемент:""; en_US = ""Cannot import the item:""")+Символы.ПС+КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СтатусСообщения.Внимание);
						Продолжить;
					КонецЕсли;
				КонецПопытки;
			КонецЕсли; // Если itemXDTO = Неопределено Тогда 
			
			Если СоответствиеСтрокЗначенийИЭлементов <> Неопределено И СоответствиеСтрокЗначенийИЭлементов[СтрокаЗначенийЭлемента] = Неопределено Тогда 
				//СоответствиеСтрокЗначенийИЭлементов.Вставить(СтрокаЗначенийЭлемента, XDTO2Строка(itemXDTO));
				СоответствиеСтрокЗначенийИЭлементов.Вставить(СтрокаЗначенийЭлемента, itemXDTO);
			КонецЕсли;
		КонецЕсли;
		
		Если currentParentXDTO <> Неопределено Тогда 
			ДеревоСвойствСвязи = Неопределено;
			Если ЗагружатьСоставИзделия Тогда // состав
				itemXDTO.link	  = СериализаторXDTO.ЗаписатьXDTO(Справочники.plm_ЭлементыСвязей.ПолучитьСсылку());
				itemXDTO.linkType = СериализаторXDTO.ЗаписатьXDTO(Перечисления.plm_ВидыВертикальныхСвязей.СоставИзделия);
				ДеревоСвойствСвязи = ДеревоСвойствСвязиОбразец.Скопировать();
			Иначе // технология
				ДоступныеШаблоныСвязей = ТЗВидовЭлементовИШаблоновСвязей.НайтиСтроки(Новый Структура("ВидЭлемента,ВидЭлементаПотомок",currentParentXDTO.elementType,itemXDTO.elementType));
				Если ДоступныеШаблоныСвязей.Количество() = 0 Тогда 
					ТекстСообщения = "Вид элемента <"+Строка(currentParentXDTO.elementType)+"> не предполагает заимствования элементов вида <"+Строка(itemXDTO.elementType)+">!";
					Если МассивСообщений.Найти(ТекстСообщения) = Неопределено Тогда 
						Сообщить(ПараметрыСеанса.plm_ПрефиксСлужебныхСообщений+ТекстСообщения,СтатусСообщения.Внимание);
						МассивСообщений.Добавить(ТекстСообщения);
					КонецЕсли;
					Продолжить;
				КонецЕсли;
				ШаблонТехСвязи = ДоступныеШаблоныСвязей[0].Ссылка;
				Если ШаблонТехСвязи.ГоризонтальнаяСвязь Тогда 
					itemXDTO.link = СериализаторXDTO.ЗаписатьXDTO(Справочники.plm_ЭлементыСвязей.ПолучитьСсылку());
					ДеревоСвойствСвязиОбразец = СоответствиеВидовЭлементовИДеревьевСвойств[ШаблонТехСвязи];
					Если ДеревоСвойствСвязиОбразец = Неопределено Тогда 
						ДеревоСвойствСвязиОбразец = plm_ПолучитьДеревоСвойств(ШаблонТехСвязи);
						СоответствиеВидовЭлементовИДеревьевСвойств.Вставить(ШаблонТехСвязи, ДеревоСвойствСвязиОбразец);
					КонецЕсли;
					ДеревоСвойствСвязи = ДеревоСвойствСвязиОбразец.Скопировать();
				КонецЕсли;
				itemXDTO.linkType = СериализаторXDTO.ЗаписатьXDTO(ШаблонТехСвязи);
			КонецЕсли;
			
			Если ДеревоСвойствСвязи <> Неопределено Тогда 
				///////////////////////////////////////////////////////////
				// заполнение значений дерева свойств по таблице (для связи)
				СтрокиДереваСвойств=ДеревоСвойствСвязи.Строки.НайтиСтроки(Новый Структура("ЭтоГруппа", Ложь), Истина);
				Для Каждого СтрокаДереваСвойств Из СтрокиДереваСвойств Цикл 
					КолонкаСпецификации = ТаблицаКолонок.Найти(СтрокаДереваСвойств.Свойство);
					Если КолонкаСпецификации <> Неопределено 
							И (НЕ ПроверятьПринадлежностьСвойства Или КолонкаСпецификации.Принадлежность <> 1) Тогда
						ИндексКолонки = ТаблицаКолонок.Индекс(КолонкаСпецификации);
						Если НаличиеКолонокЕдиницИзмерения Тогда 
							Для инд=0 По ТаблицаКолонок.Индекс(КолонкаСпецификации)-1 Цикл 
								Если ТаблицаКолонок[инд].ЕдиницыИзмерения = Истина Тогда 
									ИндексКолонки = ИндексКолонки + 1;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
							ТипЗначенияСвойства = СтрокаДереваСвойств.Свойство.ТипЗначения;
							ЗначениеПараметра = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ТипЗначенияСвойства);
							//Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда 
								СтрокаДереваСвойств.Значение = ЗначениеПараметра;
							//КонецЕсли;
							ИндексКолонки=ИндексКолонки+1; // единицы измерения
							Если КолонкаСпецификации.ЕдиницыИзмерения И ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
								СтрокаДереваСвойств.ЕдиницаИзмерения = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ОписаниеТиповЕдИзм);
							КонецЕсли;
						КонецЕсли;
						
						НайденныеСвойства.Добавить(СтрокаДереваСвойств.Свойство);
					КонецЕсли; // Если КолонкаСпецификации <> Неопределено Тогда 
				КонецЦикла;

				// параметры связи в xdto-модели
				plm_СозданиеПараметровXDTOПоДереву(ДеревоСвойствСвязи.Строки, itemXDTO, Истина);
			КонецЕсли; // Если ДеревоСвойствСвязи <> Неопределено Тогда 
			
			Если ДобавлятьОтсутствующиеСвойства Тогда 
				// оставшиеся параметры
				Для Каждого КолонкаСпецификации Из ТаблицаКолонок Цикл 
					Если НайденныеСвойства.Найти(КолонкаСпецификации.Свойство)=Неопределено И ЗначениеЗаполнено(КолонкаСпецификации.Свойство) Тогда 
						ИндексКолонки = ТаблицаКолонок.Индекс(КолонкаСпецификации);
						Если НаличиеКолонокЕдиницИзмерения Тогда 
							Для инд=0 По ТаблицаКолонок.Индекс(КолонкаСпецификации)-1 Цикл 
								Если ТаблицаКолонок[инд].ЕдиницыИзмерения = Истина Тогда 
									ИндексКолонки = ИндексКолонки + 1;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
							ТипЗначенияСвойства = КолонкаСпецификации.Свойство.ТипЗначения;
							ЗначениеПараметра = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ТипЗначенияСвойства);
							//Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда 
								УстановитьКакПараметрСвязи = Неопределено;
								Если ПроверятьПринадлежностьСвойства И КолонкаСпецификации.Принадлежность <> 0 Тогда 
									УстановитьКакПараметрСвязи = (КолонкаСпецификации.Принадлежность = 2);
								КонецЕсли;
								Если УстановитьКакПараметрСвязи=Истина И ТипЗнч(itemXDTO.link)<>Тип("СправочникСсылка.plm_ЭлементыСвязей") Тогда 
									Продолжить; // нельзя установить как параметр связи (связь не параметрическая)
								КонецЕсли;
									
								plm_УстановитьЗначениеПараметраПоСвойствуВXDTO(itemXDTO, КолонкаСпецификации.Свойство, ЗначениеПараметра, УстановитьКакПараметрСвязи);
							//КонецЕсли;
							ИндексКолонки=ИндексКолонки+1; // единицы измерения
							Если КолонкаСпецификации.ЕдиницыИзмерения И ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
								parameterXDTO = plm_ВспомНайтиПараметрПоСвойствуВXDTO(itemXDTO, КолонкаСпецификации.Свойство, УстановитьКакПараметрСвязи);
								parameterXDTO.unit = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ОписаниеТиповЕдИзм);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			
			itemXDTO.added=Истина;
			
			
			ВыбШаблонСвязи = itemXDTO.linkType;
			
			ПозДляВставки=Неопределено; // определить позицию для вставки объекта
			plm_НайтиВМассивеXDTO(currentParentXDTO.items, Новый Структура("refLinkGroup", Истина), ПозДляВставки);
			
			ФлагГоризонтальнойСвязи = (ТипЗнч(ВыбШаблонСвязи)=Тип("СправочникСсылка.plm_ШаблоныТехнологическихСвязей") И ВыбШаблонСвязи.ГоризонтальнаяСвязь);
			Если ФлагГоризонтальнойСвязи Тогда 
				// найти существующую группу связей в модели родителя
				itemRefXDTO = plm_НайтиВМассивеXDTO(currentParentXDTO.items, Новый Структура("refLinkGroup, linkType", Истина, ВыбШаблонСвязи));
				Если itemRefXDTO = Неопределено Тогда 
					// создать новую группу горизонтальных связей
					itemRefXDTO = plm_СоздатьОбъектМоделиXDTO(ВыбШаблонСвязи);
					currentParentXDTO.items.Добавить(itemRefXDTO);
				КонецЕсли;
			Иначе 
				itemRefXDTO = Неопределено;
			КонецЕсли;
			
			Если itemRefXDTO <> Неопределено Тогда 
				itemRefXDTO.items.Добавить(itemXDTO);
			ИначеЕсли ПозДляВставки <> Неопределено Тогда 
				currentParentXDTO.items.Вставить(ПозДляВставки, itemXDTO);
				ПозДляВставки = ПозДляВставки + 1;
			Иначе 
				currentParentXDTO.items.Добавить(itemXDTO);
			КонецЕсли;
			
			currentParentXDTO.modified=Истина;
		ИначеЕсли ФормаПриемник = Неопределено Тогда 
			Сообщить("Режим ""Импортировать в корень"" доступен с версией конфигурации Appius-PLM не ниже 2016.91!", СтатусСообщения.Важное);
			Прервать;
		Иначе 
			КорнСтрока = ФормаПриемник.ДеревоПредставления.Строки.Добавить();
			КорнСтрока.ЭлементСсылка	= itemXDTO.element;
			КорнСтрока.Картинка			= itemXDTO.pictureIndex;
			КорнСтрока.ОбъектXDTO		= itemXDTO;
			
			МассивКорнСтрок.Добавить(КорнСтрока);
		КонецЕсли; // Если currentParentXDTO <> Неопределено Тогда 
		
		plm_ОбновитьПредставлениеВМоделиXDTO(itemXDTO);
	КонецЦикла;
	
	Если ЗагружатьВКорень Тогда 
		Для Каждого КорнСтрока Из МассивКорнСтрок Цикл 
			Если КорнСтрока.ОбъектXDTO.items.Количество() > 0 Тогда 
				Обработки.plm_Проводник.plm_ОбновитьДеревоПоМоделиXDTOРек(КорнСтрока.ОбъектXDTO, КорнСтрока.Строки, ФормаПриемник.СтруктураПараметровОтображения);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЗагружатьСоставИзделия Тогда  
		Обработки.plm_УправлениеСтруктуройИзделия.plm_ОформитьСпецификацию(parentXDTO);
	КонецЕсли;
	
КонецПроцедуры

// Процедура импортирует данные из внешнего источника в режиме рабочей копии
// Параметры:
//		parentXDTO - объект модели XDTO
//		ТаблицаИмпорта - ТаблицаЗначений, таблица данных импорта
//		ТаблицаКолонокРесурса - ТаблицаЗначений, таблица колонок ресурса
Процедура plm_ИмпортДанныхКТС( parentXDTO, ТаблицаИмпорта, ТаблицаКолонокРесурса, ФормаПриемник = Неопределено ) Экспорт 
	Если ТаблицаКолонокРесурса=Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ТаблицаКолонок=ТаблицаКолонокРесурса.Скопировать(новый Структура("Видимость",Истина));
	Если ТаблицаКолонок.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;	
	МассивРодителей=Новый Массив();
	МассивРодителей.Добавить( parentXDTO );
	itemXDTO=Неопределено;
	ТекущийУровень=1;
	ВидЭлементовРесурса=plm_ПолучитьЗначениеПараметраПоСвойствуВXDTO(parentXDTO,ПланыВидовХарактеристик.plm_Свойства.ВидРесурса,Ложь );
	Для i=0 По ТаблицаИмпорта.Количество()-1 Цикл 
		СтрокаИмпорта=ТаблицаИмпорта[i];
		ВидЭлементаИмпорта = СтрокаИмпорта.ВидЭлемента;
		Если ВидЭлементовРесурса<>ВидЭлементаИмпорта Тогда
			Продолжить;
		КонецЕсли;		
		Если ТипЗнч(ВидЭлементаИмпорта)<>Тип("СправочникСсылка.plm_ВидыЭлементов") Тогда 
			itemXDTO = plm_СоздатьОбъектМоделиXDTO(ВидЭлементаИмпорта);
		Иначе
			
			Попытка
				НачатьТранзакцию();
				СозданныйОбъект = Обработки.plm_СозданиеОбъектов.plm_СозданиеОбъекта(ВидЭлементаИмпорта, Новый ДеревоЗначений);
				// заполнение параметров элемента по параметрам ресурса
				Обработки.plm_КонструкторскоТехнологическийСправочник.plm_СоздатьНаборПараметровЭлементаРесурса(СозданныйОбъект, parentXDTO.element);
				Если parentXDTO.element.ПредставлениеЭлементовРесурса.Количество() > 0 Тогда 
					// использовать представление ресурса
					Обработки.plm_КонструкторскоТехнологическийСправочник.plm_СоздатьПредставлениеЭлементаРесурса(СозданныйОбъект, parentXDTO.element);
				Иначе 
					// использовать представление вида элемента
					Обработки.plm_СозданиеОбъектов.plm_СоздатьПредставление(СозданныйОбъект);
				КонецЕсли;
				
				/////////////////////////////////////////////////////
				// заполнение значений параметров по таблице (для элемента)
				Для Каждого СтрокаПараметра Из СозданныйОбъект.Параметры Цикл 
					МассивКолонокРесурса = ТаблицаКолонок.НайтиСтроки(Новый Структура("ИмяПараметра,Свойство", СтрокаПараметра.Параметр.Наименование,СтрокаПараметра.Параметр.Свойство));
					Если МассивКолонокРесурса.Количество() > 0 Тогда 
						КолонкаРесурса = МассивКолонокРесурса[0];
						ИндексКолонки = ТаблицаКолонок.Индекс(КолонкаРесурса);
						Если ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
							ТипЗначенияСвойства = СтрокаПараметра.Параметр.Свойство.ТипЗначения;
							ЗначениеПараметра = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ТипЗначенияСвойства);
							//Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда 
							ОбъектПараметра = СтрокаПараметра.Параметр.ПолучитьОбъект();
							ОбъектПараметра.Значение = ЗначениеПараметра;
							ОбъектПараметра.Записать();
							//КонецЕсли;
						КонецЕсли;
					КонецЕсли; // Если КолонкаРесурса <> Неопределено Тогда 
				КонецЦикла;
				
				СозданныйОбъект.ДополнительныеСвойства.Вставить("ПроверитьУникальность", Ложь);
				СозданныйОбъект.Записать();
				itemXDTO = plm_СоздатьОбъектМоделиXDTO(СозданныйОбъект.Ссылка);
				itemXDTO.created = Истина;
				plm_ЗаполнитьПредставлениеМоделиПоТабЧасти(itemXDTO, СозданныйОбъект.ПредставлениеЭлемента);
				ОтменитьТранзакцию(); // отмена транзации после создания xdto-модели
			Исключение
				ОтменитьТранзакцию();
				Сообщить(ПараметрыСеанса.plm_ПрефиксСлужебныхСообщений+НСтр("ru = ""Не удалось импортировать элемент:""; en_US = ""Cannot import the item:""")+Символы.ПС+КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), СтатусСообщения.Внимание);
				Продолжить;
			КонецПопытки;						
		КонецЕсли;
	
					
		itemXDTO.linkType = СериализаторXDTO.ЗаписатьXDTO(Справочники.plm_ШаблоныТехнологическихСвязей.Ресурсы);
		
		//// оставшиеся параметры
		//Для Каждого КолонкаРесурса Из ТаблицаКолонок Цикл 
		//	Если НайденныеСвойства.Найти(КолонкаРесурса.Свойство)=Неопределено И ЗначениеЗаполнено(КолонкаРесурса.Свойство) Тогда 
		//		ИндексКолонки = ТаблицаКолонок.Индекс(КолонкаРесурса);
		//		Если ИндексКолонки < ТаблицаИмпорта.Колонки.Количество()-2 Тогда 
		//			ТипЗначенияСвойства = КолонкаРесурса.Свойство.ТипЗначения;
		//			ЗначениеПараметра = plm_ПреобразоватьЗначениеПараметра(СтрокаИмпорта[ИндексКолонки+2], ТипЗначенияСвойства);
		//			//Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда 
		//			МодульСозданияПараметров.plm_УстановитьЗначениеПараметраПоСвойствуВXDTO(itemXDTO, КолонкаРесурса.Свойство, ЗначениеПараметра);
		//			//КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
		
		itemXDTO.added	  =Истина;
		itemXDTO.modified =Истина;
		
		plm_ОбновитьПредставлениеВМоделиXDTO(itemXDTO);
		
		
		currentParentXDTO=МассивРодителей[МассивРодителей.Количество()-1];
		
		ПозДляВставки=Неопределено; // определить позицию для вставки объекта
		plm_НайтиВМассивеXDTO(currentParentXDTO.items, Новый Структура("refLinkGroup", Истина), ПозДляВставки);
		
		Если ПозДляВставки <> Неопределено Тогда 
			currentParentXDTO.items.Вставить(ПозДляВставки, itemXDTO);
			ПозДляВставки = ПозДляВставки + 1;
		Иначе 
			currentParentXDTO.items.Добавить(itemXDTO);
		КонецЕсли;
		
		currentParentXDTO.modified=Истина;
	КонецЦикла; // Для i=0 По ТаблицаИмпорта.Количество()-1 Цикл
КонецПроцедуры



МассивТипов=Новый Массив();
МассивТипов.Добавить(Тип("СправочникСсылка.plm_ВидыЭлементов"));
МассивТипов.Добавить(Тип("СправочникСсылка.plm_ЭлементыСтруктуры"));
ОписаниеТиповЯчейки=Новый ОписаниеТипов(МассивТипов);

ОписаниеТиповЯчейкиУровня=Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));


