
&НаКлиенте
Процедура УстановкаВидовЭлементов(Команда)
	ВыбранныйВидЭлемента=ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПустаяСсылка");
	Если Команда.Имя="Документ" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.Документ");
	ИначеЕсли Команда.Имя="Сборка" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.СбЕдиница");
	ИначеЕсли Команда.Имя="Деталь" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.Деталь");
	ИначеЕсли Команда.Имя="Стандартное" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.СтИзд");
	ИначеЕсли Команда.Имя="Прочее" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПрИзд");
	ИначеЕсли Команда.Имя="Материал" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.Материал");
	ИначеЕсли Команда.Имя="Комплект" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.Комплект");
	ИначеЕсли Команда.Имя="ЭРИ" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ЭлектроРадиоЭлемент");
	ИначеЕсли Команда.Имя="СТО" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.СредствоТехнологическогоОснащения");
		
	ИначеЕсли Команда.Имя="Маршрут" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.Маршрут");
	ИначеЕсли Команда.Имя="Техпроцесс" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ТехнологическийПроцесс");
	ИначеЕсли Команда.Имя="ПунктОбработки" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПунктОбработки");
	ИначеЕсли Команда.Имя="ПунктПеремещения" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПунктПеремещения");
	ИначеЕсли Команда.Имя="ПунктСкладирования" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПунктСкладирования");
	ИначеЕсли Команда.Имя="ПунктКонтроля" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПунктКонтроля");
	ИначеЕсли Команда.Имя="ПунктКооперации" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПунктКооперации");
	ИначеЕсли Команда.Имя="ТехнологическаяОперация" Тогда
		ВыбранныйВидЭлемента = ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ТехнологическаяОперация");
	КонецЕсли;
	
	ТабДок = ТабличныйДокумент;
	ВыделенныеОбласти = ТабДок.ВыделенныеОбласти;
	
	Для Каждого ВыдОбласть Из ВыделенныеОбласти Цикл
		Если ВыдОбласть.ТипОбласти=ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда 
			Для i=1 По ТабДок.ВысотаТаблицы Цикл 
				ЗаполнитьОбласть(ТабДок.Область(i,2,i,2), ВыбранныйВидЭлемента);
			КонецЦикла;
		Иначе 
			Для i=ВыдОбласть.Верх По ВыдОбласть.Низ Цикл 
				ЗаполнитьОбласть(ТабДок.Область(i,2,i,2), ВыбранныйВидЭлемента);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьОбласть(Область, Знч) 
	МассивТипов=Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.plm_ВидыЭлементов"));
	МассивТипов.Добавить(Тип("СправочникСсылка.plm_ЭлементыСтруктуры"));
	ОписаниеТиповЯчейки=Новый ОписаниеТипов(МассивТипов);
	
	Область.СодержитЗначение=Истина;
	Область.ТипЗначения=ОписаниеТиповЯчейки;    
	Область.Значение=Знч;
	Область.ЦветФона=ПолучитьЦвет("ЦветФонаКнопки");
КонецФункции

&НаКлиенте
Функция ЗаполнитьОбластьУровня(Область, Знч) 
	ОписаниеТиповЯчейкиУровня=Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
	
	Область.СодержитЗначение=Истина;
	Область.ТипЗначения=ОписаниеТиповЯчейкиУровня;
	Область.Значение=Знч;
	Область.ЦветФона=ПолучитьЦвет("ЦветФонаКнопки");
КонецФункции

&НаСервере
Функция ПолучитьЦвет(ИмяЦвета)
	возврат ЦветаСтиля[ИмяЦвета];
КонецФункции

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьBOMФайл(Команда)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл данных";
	ДиалогОткрытияФайла.Фильтр = "Текстовые документы (*.txt)|*.txt|PCAD Bill of materials (*.bom)|*.bom|"; 
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		//Если СтрНайти(ИмяФормы, "ВнешняяОбработка") Тогда
		//    ИмяФормыДляОткрытия = "ВнешняяОбработка.plm_ИмпортИзВнешнихИсточников.Форма.ФормаНастроекЧтенияBOM";
		//Иначе
		//    ИмяФормыДляОткрытия = "Обработка.plm_ИмпортИзВнешнихИсточников.Форма.ФормаНастроекЧтенияBOM";
		//КонецЕсли;
		ИмяФормыДляОткрытия = СтрЗаменить(ЭтотОбъект.ИмяФормы, ".Форма.Форма", ".Форма.ФормаНастроекЧтенияBOM");
		
		Форма = ПолучитьФорму(ИмяФормыДляОткрытия, , ЭтаФорма);
		СтруктураПараметровЧтения=Форма.ОткрытьМодально();
		Если СтруктураПараметровЧтения=Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Попытка
			ТДокумент=Новый ТекстовыйДокумент();
			ТДокумент.Прочитать(ДиалогОткрытияФайла.ПолноеИмяФайла);
			ПрочитатьДанныеBOM(ТабличныйДокумент, ТДокумент, Прогресс, СтруктураПараметровЧтения);
		Исключение
			Сообщить(plm_ПолныеПрава.plm_ПараметрСеанса("plm_ПрефиксСлужебныхСообщений")+"Ошибка при работе с текстовым документом: "+ОписаниеОшибки());
			Возврат;
		КонецПопытки;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлEXCEL(Команда)
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл данных";
	ДиалогОткрытияФайла.Фильтр = "Файлы Excel (*.xl;*.xlsx;*.xlsm;*.xlsb;*.xlam;*.xltx;*.xltm;*.xls;*.xla;*.xlt;*.xlm;*.xlw)|*.xl;*.xlsx;*.xlsm;*.xlsb;*.xlam;*.xltx;*.xltm;*.xls;*.xla;*.xlt;*.xlm;*.xlw|"; 
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Попытка
			ExcelПриложение = Новый COMОбъект("Excel.Application");
			ExcelФайл = ExcelПриложение.WorkBooks.Open( ДиалогОткрытияФайла.ПолноеИмяФайла );
			ExcelЛист = ExcelФайл.Sheets(1);
			ПрочитатьДанныеEXCEL(ТабличныйДокумент, ExcelЛист, Прогресс, Неопределено);
			ExcelФайл.Close();
			ExcelПриложение.Quit();
		Исключение
			Сообщить(plm_ПолныеПрава.plm_ПараметрСеанса("plm_ПрефиксСлужебныхСообщений")+"Ошибка при работе с Microsoft Excel: "+ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьДанныеEXCEL( ТабДок, ExcelЛист, Прогресс, СтруктураНастроек )
	xlCellTypeLastCell = 11;
	Rows = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
	Cols = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
	
	Элементы.Прогресс.МаксимальноеЗначение=Rows;
	Элементы.Прогресс.МинимальноеЗначение=1;
	
	МассивСтрок = новый массив;
	Для i=1 По Rows Цикл
		Прогресс=i;
		
		НоваяСтрока = новый структура;
		
		outLineLevel=ExcelЛист.Rows(i).OutlineLevel;
		
		НоваяСтрока.Вставить("outLineLevel", outLineLevel);
		НоваяСтрока.Вставить("Cols", новый массив);
		НоваяСтрока.Вставить("ColumnWidth", новый массив);
		
		Для j=1 По Cols Цикл
			НоваяСтрока.ColumnWidth.Добавить(ExcelЛист.Columns(j).ColumnWidth);
			НоваяСтрока.Cols.Добавить(ExcelЛист.Cells(i,j).Value);
		КонецЦикла;
		МассивСтрок.Добавить(НоваяСтрока);
	КонецЦикла;
	
	ЗаписатьДанныеТабДок(ТабДок, МассивСтрок);
	Прогресс=0;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеТабДок(ТабДок, МассивСтрок)
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	ОбрОбъект.ЗаписатьДанныеEXCEL(ТабДок, МассивСтрок);
КонецПроцедуры
	
&НаСервере
Процедура ПрочитатьДанныеBOM( ТабДок, ТДокумент, Прогресс, ПараметрыЧтения )
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	ОбрОбъект.ПрочитатьДанныеBOM(ТабДок, ТДокумент, Прогресс, ПараметрыЧтения);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ТабДок = ТабличныйДокумент;
	Для i=1 По ТабДок.ВысотаТаблицы Цикл
		Попытка 
			Если Число(ТабДок.Область(i,1,i,1).Текст)<>0 и	Цел(Число(ТабДок.Область(i,1,i,1).Текст))=Число(ТабДок.Область(i,1,i,1).Текст) Тогда 
				ЗаполнитьОбластьУровня(ТабДок.Область(i,1,i,1),Число(ТабДок.Область(i,1,i,1).Текст));	
			Иначе	
				ЗаполнитьОбластьУровня(ТабДок.Область(i,1,i,1), 1);
			КонецЕсли;
		Исключение
			ЗаполнитьОбластьУровня(ТабДок.Область(i,1,i,1), 1);
		КонецПопытки;	
		ЗаполнитьОбласть(ТабДок.Область(i,2,i,2), ?(ПустаяСтрока(ТабДок.Область(i,2,i,2).Текст), ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПустаяСсылка"), НайтиВидПоНаименованию(ТабДок.Область(i,2,i,2).Текст)));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция НайтиВидПоНаименованию(Текст)
	возврат Справочники.plm_ВидыЭлементов.НайтиПоНаименованию(Текст);
КонецФункции
	
&НаКлиенте
Процедура ПодобратьЭлементы(Команда)
	ТабДок = ТабличныйДокумент;
	ВыделенныеОбласти = ТабДок.ВыделенныеОбласти;
	
	Элементы.Прогресс.МаксимальноеЗначение=ТабДок.ВысотаТаблицы;
	
	Для i=1 По ТабДок.ВысотаТаблицы Цикл 
		МассивЗначений=Новый Массив;
		Для Каждого ВыдОбласть Из ВыделенныеОбласти Цикл
			Если ВыдОбласть.ТипОбласти<>ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда 
				Продолжить;
			КонецЕсли;
			
			Для j=ВыдОбласть.Лево По ВыдОбласть.Право Цикл 
				ОбластьЯчейки=ТабДок.Область(i,j,i,j);
				Если ЗначениеЗаполнено(ОбластьЯчейки.Текст) Тогда 
					МассивЗначений.Добавить(ОбластьЯчейки.Текст);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Прогресс=Прогресс+1;
		
		Если МассивЗначений.Количество() > 0 Тогда 
			ПодобратьЭлементПоСвойствам(i, МассивЗначений);
		КонецЕсли;
	КонецЦикла;
	
	Прогресс=0;
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабДокНаСервере()
	ТабличныйДокумент.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВыделенныеОбласти()     
    Элементы.ТабличныйДокумент.УстановитьВыделенныеОбласти(Новый Массив);
КонецПроцедуры

&НаСервере
Процедура ПодобратьЭлементПоСвойствам(Поз, МассивЗначений)
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	
	Элем = ОбрОбъект.plm_ПодборЭлементовПоСвойствам(МассивЗначений);
	Если Элем.Количество()>0 Тогда
		ОбрОбъект.ЗаполнитьОбласть(ТабличныйДокумент.Область(Поз,2,Поз,2), Элем[0].ЭлементСсылка);
	//Иначе 
	//	ОбрОбъект.ЗаполнитьОбласть(ТабличныйДокумент.Область(Поз,2,Поз,2), ПредопределенноеЗначение("Справочник.plm_ВидыЭлементов.ПустаяСсылка"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьПодобранные(Команда)
	ВыделитьПодобранныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыделитьПодобранныеНаСервере()
	НовыеВыделенныеОбласти = новый массив;
	
	Для i=1 По ТабличныйДокумент.ВысотаТаблицы Цикл 
		Область=ТабличныйДокумент.Область(i,2,i,2);
		Если Область.СодержитЗначение И ЗначениеЗаполнено(Область.Значение)
					И ТипЗнч(Область.Значение)<>Тип("СправочникСсылка.plm_ВидыЭлементов") Тогда 
			НовыеВыделенныеОбласти.Добавить(ТабличныйДокумент.Область(i,0,i,0));
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТабличныйДокумент.УстановитьВыделенныеОбласти(НовыеВыделенныеОбласти);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенные(Команда)
	Для Каждого ВыделеннаяОбласть Из ТабличныйДокумент.ВыделенныеОбласти Цикл 
		УдалитьВыделенныеНаСервере(ВыделеннаяОбласть.Имя);
	КонецЦикла;
	
	Элементы.ТабличныйДокумент.УстановитьВыделенныеОбласти(Новый Массив);
КонецПроцедуры

&НаСервере
Процедура УдалитьВыделенныеНаСервере(ИмяОбласти)
	ВыделеннаяОбласть = ТабличныйДокумент.Область(ИмяОбласти);
	
	Если ВыделеннаяОбласть.ТипОбласти=ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда 
		Сдвиг=ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	ИначеЕсли ВыделеннаяОбласть.ТипОбласти=ТипОбластиЯчеекТабличногоДокумента.Строки Тогда 
		Сдвиг=ТипСмещенияТабличногоДокумента.ПоВертикали;
	Иначе 
		Сдвиг=ТипСмещенияТабличногоДокумента.БезСмещения;
	КонецЕсли;
	
	ТабличныйДокумент.УдалитьОбласть(ВыделеннаяОбласть, Сдвиг);
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьТабДокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ДиалогОткрытия=Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Открытие );
	ДиалогОткрытия.Фильтр="Табличный документ(*.mxl)|*.mxl|Все файлы (*.*)|*.*";
	Если ДиалогОткрытия.Выбрать() Тогда
		Адрес = "";
      	ПоместитьФайлВВремХранилище(Адрес, ДиалогОткрытия.ПолноеИмяФайла);
		ЗагрузитьИзФайлаНаСервере(Адрес);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьФайлВВремХранилище(Адрес,ПолноеИмяФайла)
    ПоместитьФайл(Адрес,ПолноеИмяФайла,,Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(Адрес)
	ИмяВременогоФайла = ПолучитьИмяВременногоФайла(".mxl");    
    Файл = ПолучитьИзВременногоХранилища(Адрес);
    Файл.Записать(ИмяВременогоФайла);
	ТабличныйДокумент.Прочитать(ИмяВременогофайла);
КонецПроцедуры
	
&НаКлиенте
Процедура СохранитьВФайл(Команда)
	ДиалогСохранения=Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Сохранение );
	ДиалогСохранения.Фильтр="Табличный документ(*.mxl)|*.mxl|Все файлы (*.*)|*.*";
	Если ДиалогСохранения.Выбрать() Тогда
		ТабличныйДокумент.Записать( ДиалогСохранения.ПолноеИмяФайла );
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыполнитьНажатие(Команда)
	Таблица = ИмпортНаСервере();
	Оповестить("plm_ИмпортСпецификации", Таблица, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере()
	// сформировать таблицу значений по табличному документу
	Таблица=Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Уровень");
	Таблица.Колонки.Добавить("ВидЭлемента");
	
	Для j=3 По ТабличныйДокумент.ШиринаТаблицы Цикл 
		Таблица.Колонки.Добавить("Колонка_"+Строка(j-2));
	КонецЦикла;
	
	Для i=1 По ТабличныйДокумент.ВысотаТаблицы Цикл 
		Область=ТабличныйДокумент.Область(i,2,i,2);
		Если Область.СодержитЗначение И ЗначениеЗаполнено(Область.Значение) И 
			 (ТипЗнч(Область.Значение)=Тип("СправочникСсылка.plm_ВидыЭлементов") Или
			  ТипЗнч(Область.Значение)=Тип("СправочникСсылка.plm_ЭлементыСтруктуры")) Тогда 
					
			СтрокаТаблицы=Таблица.Добавить();			
			СтрокаТаблицы.ВидЭлемента=Область.Значение;
			
			УровеньОбласть=ТабличныйДокумент.Область(i,1,i,1);
			Если УровеньОбласть.СодержитЗначение И УровеньОбласть.ТипЗначения.СодержитТип(Тип("Число")) И 
				 УровеньОбласть.Значение > 1 Тогда
				СтрокаТаблицы.Уровень=УровеньОбласть.Значение;
			Иначе
				СтрокаТаблицы.Уровень=1;
			КонецЕсли;
			Для j=3 По ТабличныйДокумент.ШиринаТаблицы Цикл 
				Область=ТабличныйДокумент.Область(i,j,i,j);
				СтрокаТаблицы["Колонка_"+Строка(j-2)]=Строка(Область.Текст);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Таблица);
	возврат ПоместитьВоВременноеХранилище(Таблица, ЭтаФорма.УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура КоманднаяПанельОбработкаРевизийИсполнения(Команда)
	//Если СтрНайти(ИмяФормы, "ВнешняяОбработка") Тогда
	//    ИмяФормыДляОткрытия = "ВнешняяОбработка.plm_ИмпортИзВнешнихИсточников.Форма.ФормаОбработкиИсполнений";
	//Иначе
	//    ИмяФормыДляОткрытия = "Обработка.plm_ИмпортИзВнешнихИсточников.Форма.ФормаОбработкиИсполнений";
	//КонецЕсли;
	ИмяФормыДляОткрытия = СтрЗаменить(ЭтотОбъект.ИмяФормы, ".Форма.Форма", ".Форма.ФормаОбработкиИсполнений");
	
	ОткрытьФорму(ИмяФормыДляОткрытия, , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура plm_ИмпортДанныхСпецификации( parentXDTO, ТаблицаИмпорта, ТаблицаКолонокСпецификации, ФормаПриемник = Неопределено ) Экспорт
	ИмпортДанныхСпецификацииНаСервере(parentXDTO, ТаблицаИмпорта, ТаблицаКолонокСпецификации, ФормаПриемник);
КонецПроцедуры

&НаКлиенте
Процедура plm_ИмпортДанныхКТС( parentXDTO, ТаблицаИмпорта, ТаблицаКолонокРесурса, ФормаПриемник = Неопределено ) Экспорт
	ИмпортДанныхКТСНаСервере(parentXDTO, ТаблицаИмпорта, ТаблицаКолонокРесурса, ФормаПриемник);
КонецПроцедуры

&НаСервере
Процедура ИмпортДанныхСпецификацииНаСервере( parentXDTO, ТаблицаИмпорта, ТаблицаКолонокСпецификации, ФормаПриемник)
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	
	ДанныеТаблицы = ПолучитьИзВременногоХранилища(ЭтаФорма.УникальныйИдентификатор);
	ОбрОбъект.plm_ИмпортДанныхСпецификации(parentXDTO, ДанныеТаблицы, ТаблицаКолонокСпецификации, ФормаПриемник);
	УдалитьИзВременногоХранилища(ЭтаФорма.УникальныйИдентификатор);	
КонецПроцедуры

&НаСервере
Процедура ИмпортДанныхКТСНаСервере( parentXDTO, ТаблицаИмпорта, ТаблицаКолонокРесурса, ФормаПриемник)
	ОбрОбъект = РеквизитФормыВЗначение("Объект");
	
	ДанныеТаблицы = ПолучитьИзВременногоХранилища(ЭтаФорма.УникальныйИдентификатор);
	ОбрОбъект.plm_ИмпортДанныхКТС(parentXDTO, ДанныеТаблицы, ТаблицаКолонокРесурса, ФормаПриемник);
	УдалитьИзВременногоХранилища(ЭтаФорма.УникальныйИдентификатор);	
КонецПроцедуры