
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
	
	Если Дерево.ПолучитьЭлементы().Количество() = 0 Тогда 
		Предупреждение("Исполнения, не связанные ревизионной связью, не найдены!");
		Возврат;
	КонецЕсли;
	
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для Каждого СтрокаДокумента Из ЭлементыДерева Цикл 
		Элементы.Дерево.Развернуть(СтрокаДокумента.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ДеревоОб = РеквизитФормыВЗначение("Дерево");
	ДеревоОб.Строки.Очистить();
	
	тзСвойстваДляПоиска = Новый ТаблицаЗначений;
	тзСвойстваДляПоиска.Колонки.Добавить("Свойство");
	тзСвойстваДляПоиска.Колонки.Добавить("ВидСравнения");
	тзСвойстваДляПоиска.Колонки.Добавить("Значение");
	СтрокаСвойства = тзСвойстваДляПоиска.Добавить();
	СтрокаСвойства.Свойство = ПланыВидовХарактеристик.plm_Свойства.ВидДокумента;
	СтрокаСвойства.ВидСравнения = ВидСравнения.ВСписке;
	СтрокаСвойства.Значение = ФильтрДокументов.ВыгрузитьЗначения();
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("ВидЭлемента", Справочники.plm_ВидыЭлементов.Документ);
	СтруктураПоиска.Вставить("СвойстваДляПоиска", тзСвойстваДляПоиска);
	
	тзДокументы = Обработки.plm_Поиск.plm_Поиск(СтруктураПоиска);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = "ВЫБРАТЬ
				   |	ТаблицаСсылок.ЭлементСсылка КАК ЭлементСсылка
				   |ПОМЕСТИТЬ ВТСсылки
				   |ИЗ
				   |	&Данные КАК ТаблицаСсылок";
	Запрос.УстановитьПараметр("Данные", тзДокументы);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	plm_ЭлементыСтруктурыПараметры.Ссылка,
	               |	plm_ЭлементыСтруктурыПараметры.Параметр.Свойство КАК ПараметрСвойство,
	               |	plm_ЭлементыСтруктурыПараметры.Параметр.Значение КАК ПараметрЗначение
	               |ПОМЕСТИТЬ ВТПараметры
	               |ИЗ
	               |	Справочник.plm_ЭлементыСтруктуры.Параметры КАК plm_ЭлементыСтруктурыПараметры
	               |ГДЕ
	               |	plm_ЭлементыСтруктурыПараметры.Параметр.Свойство = &Свойство1
				   |	ИЛИ plm_ЭлементыСтруктурыПараметры.Параметр.Свойство = &Свойство2";
	Запрос.УстановитьПараметр("Свойство1", ПланыВидовХарактеристик.plm_Свойства.Обозначение);
	Запрос.УстановитьПараметр("Свойство2", ПланыВидовХарактеристик.plm_Свойства.НомерИсполнения);
	Запрос.Выполнить();
				   
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	plm_ЭлементыСвязей.РодительСсылка КАК РодительСсылка,
	               |	plm_ЭлементыСвязей.РодительСсылка.ОригиналРевизии КАК ОригиналРевизии,
	               |	plm_ЭлементыСвязей.ПотомокСсылка КАК ПотомокСсылка,
	               |	ВТПараметры1.ПараметрЗначение КАК Обозначение,
				   |	ВЫБОР КОГДА ВТПараметры2.ПараметрЗначение ЕСТЬ NULL ТОГДА """" ИНАЧЕ ВТПараметры2.ПараметрЗначение КОНЕЦ КАК НомерИсполнения
	               |ИЗ
	               |	ВТСсылки КАК ВТСсылки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.plm_ЭлементыСвязей КАК plm_ЭлементыСвязей
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПараметры КАК ВТПараметры1
	               |			ПО plm_ЭлементыСвязей.РодительСсылка = ВТПараметры1.Ссылка
				   |				И ВТПараметры1.ПараметрСвойство = &Свойство1
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТПараметры КАК ВТПараметры2
	               |			ПО plm_ЭлементыСвязей.РодительСсылка = ВТПараметры2.Ссылка
				   |				И ВТПараметры2.ПараметрСвойство = &Свойство2
	               |		ПО ВТСсылки.ЭлементСсылка = plm_ЭлементыСвязей.ПотомокСсылка
	               |ГДЕ
	               |	plm_ЭлементыСвязей.ВидСвязи = &ВидСвязи
	               |	И НЕ plm_ЭлементыСвязей.ПометкаУдаления
				   //|	И plm_ЭлементыСвязей.РодительСсылка.ОригиналРевизии = НЕОПРЕДЕЛЕНО
	               |
	               |УПОРЯДОЧИТЬ ПО
				   //|	plm_ЭлементыСвязей.ПотомокСсылка.Наименование,
				   |	ПотомокСсылка,
	               |	Обозначение, НомерИсполнения, plm_ЭлементыСвязей.РодительСсылка.Наименование";
	Запрос.УстановитьПараметр("ВидСвязи", Перечисления.plm_ВидыВертикальныхСвязей.СоставИзделия);
	
	тзПрименяемость=Запрос.Выполнить().Выгрузить();
	
	Документ = Неопределено;
	СтрокаДокумента = Неопределено;
	ОбозначениеОригинала = "";
	
	тзДокументы = тзПрименяемость.Скопировать();
	тзДокументы.Свернуть("ПотомокСсылка");
	МассивДокументов = тзДокументы.ВыгрузитьКолонку(0);
	Для Каждого Документ Из МассивДокументов Цикл 
		СтрокиПрименяемости = тзПрименяемость.НайтиСтроки(Новый Структура("ПотомокСсылка", Документ));
		Если СтрокиПрименяемости.Количество() = 1 Тогда //единичная применяемость
			Продолжить;
		КонецЕсли;	
		Если тзПрименяемость.НайтиСтроки(Новый Структура("ПотомокСсылка, ОригиналРевизии", Документ, Неопределено)).Количество() <= 1 Тогда //все элементы связаны ревизионной связью
			Продолжить;
		КонецЕсли;	
		СтрокаДокумента = ДеревоОб.Строки.Добавить();
		СтрокаДокумента.ЭлементСсылка = Документ;
		Для Каждого СтрокаПрименяемости Из СтрокиПрименяемости Цикл 
			Если ЗначениеЗаполнено(СтрокаПрименяемости.ОригиналРевизии) 
					И plm_ВспомНайтиПараметрПоСвойству(СтрокаПрименяемости.РодительСсылка, ПланыВидовХарактеристик.plm_Свойства.СпособСозданияРевизии).Значение <> Справочники.plm_СпособыСозданияРевизий.Исполнение Тогда 
				Продолжить;
			КонецЕсли;
			СтрокаЭлемента = СтрокаДокумента.Строки.Добавить();
			СтрокаЭлемента.ЭлементСсылка = СтрокаПрименяемости.РодительСсылка;
			СтрокаЭлемента.ОригиналРевизии = СтрокаПрименяемости.ОригиналРевизии;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоОб, "Дерево");
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	УстановкаФлажков(Дерево, истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановкаФлажков(Дерево, ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции, ЗначениеПометки)

    ПодчинЭлементы = ЭлементКоллекции.ПолучитьЭлементы();
    Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
        ТекЭлемент.Выбран = ЗначениеПометки;
        УстановкаФлажков(ТекЭлемент, ТекЭлемент.Выбран);
    КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	ТекДанные = Элемент.ТекущиеДанные;
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		plm_СтруктураПараметровОповещения.Очистить();
		plm_СтруктураПараметровОповещения.Вставить("item",ТекДанные.ЭлементСсылка);
		Оповестить("AppiusWindowGeneralNotify", plm_СтруктураПараметровОповещения, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельПоискаУправлениеИзделиями(Кнопка)
	plm_ОткрытьВОкнеУправленияИзделиями(ПолучитьВыделенныеОбъекты());
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельПоискаУправлениеТехнологиейИзготовления(Кнопка)
	plm_ОткрытьВОкнеУправленияТехнологией(ПолучитьВыделенныеОбъекты());
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельПоискаПроводник(Кнопка)
	plm_ОткрытьВПроводнике(ПолучитьВыделенныеОбъекты());
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыделенныеОбъекты()
	массивВыделенных = Новый Массив;
	Для Каждого Строка Из Элементы.Дерево.ВыделенныеСтроки Цикл 
		элем = Дерево.НайтиПоИдентификатору(Строка);
		массивВыделенных.Добавить(элем.ЭлементСсылка);
	КонецЦикла;
	Возврат массивВыделенных;
КонецФункции

&НаКлиенте
Процедура КоманднаяПанель1СоздатьРевизии(Кнопка)
	СоздатьРевизииНаСервере();
	Предупреждение("Обработка завершена!");
КонецПроцедуры
	
&НаСервере
Процедура СоздатьРевизииНаСервере()
	НачатьТранзакцию();
	Попытка
	
		ДеревоОб = РеквизитФормыВЗначение("Дерево");
		
		СтрокиВыбранныхДокументов = ДеревоОб.Строки.НайтиСтроки(Новый Структура("Выбран", Истина));
		Для Каждого СтрокаДокумента Из СтрокиВыбранныхДокументов Цикл
			
			//СтрокаДокумента.Строки.Сортировать("ЭлементСсылка Возр");
			ОригиналРевизии = СтрокаДокумента.Строки[0].ЭлементСсылка;
			ОбозначениеОригинала = plm_ВспомНайтиПараметрПоСвойству(ОригиналРевизии, ПланыВидовХарактеристик.plm_Свойства.Обозначение).Значение;
			НомерИсполненияОригинала = ""; // выделяем номер исполнения из обозначения оригинала
			Для инд = 1 По СтрДлина(ОбозначениеОригинала) Цикл 
				обр_инд = СтрДлина(ОбозначениеОригинала) - инд;
				Если Сред(ОбозначениеОригинала, обр_инд, 1) = "-" Тогда 
					НомерИсполненияОригинала = Сред(ОбозначениеОригинала, обр_инд+1);
					ОбозначениеОригинала = Лев(ОбозначениеОригинала, обр_инд-1);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ОбъектОригинала = ОригиналРевизии.ПолучитьОбъект();
			Если ЗначениеЗаполнено(ОбъектОригинала.ОригиналРевизии) Тогда 
				ОбъектОригинала.ОригиналРевизии = Неопределено;
				ОбъектОригинала.ПредыдущаяРевизия = Неопределено;
			КонецЕсли;
			Если НЕ ПустаяСтрока(НомерИсполненияОригинала) Тогда
				ОбъектОригинала = ОригиналРевизии.ПолучитьОбъект();
				Обработки.plm_СозданиеОбъектов.plm_УстановкаПараметра(ОбъектОригинала, ПланыВидовХарактеристик.plm_Свойства.Обозначение, ОбозначениеОригинала);
				Обработки.plm_СозданиеОбъектов.plm_УстановкаПараметра(ОбъектОригинала, ПланыВидовХарактеристик.plm_Свойства.СпособСозданияРевизии, Справочники.plm_СпособыСозданияРевизий.Исполнение);
				Обработки.plm_СозданиеОбъектов.plm_УстановкаПараметра(ОбъектОригинала, ПланыВидовХарактеристик.plm_Свойства.НомерИсполнения, НомерИсполненияОригинала);
				plm_СоздатьПредставлениеРевизии2(ОбъектОригинала, Справочники.plm_СпособыСозданияРевизий.Исполнение);
			КонецЕсли;
			Если ОбъектОригинала.Модифицированность() Тогда 
				ОбъектОригинала.ДополнительныеСвойства.Вставить("ПроверитьУникальность", Ложь);
				ОбъектОригинала.Записать();
			КонецЕсли;
			
			Для i = 1 По СтрокаДокумента.Строки.Количество()-1 Цикл
				Ревизия = СтрокаДокумента.Строки[i].ЭлементСсылка;
				//Если Ревизия.ОригиналРевизии <> Неопределено Тогда
				//	Продолжить;
				//КонецЕсли;
				ОбозначениеЭлемента = plm_ВспомНайтиПараметрПоСвойству(Ревизия, ПланыВидовХарактеристик.plm_Свойства.Обозначение).Значение;
				НомерИсполнения = СтрЗаменить(ОбозначениеЭлемента, ОбозначениеОригинала, "");
				НомерИсполнения = СокрЛП(НомерИсполнения);
				Если КодСимвола(НомерИсполнения, 1) = КодСимвола("-") Тогда
					НомерИсполнения = Сред(НомерИсполнения, 2);
				КонецЕсли;
				
				ПараметрыРевизии = Новый ТаблицаЗначений;
			    ПараметрыРевизии.Колонки.Добавить("Параметр");
			    ПараметрыРевизии.Колонки.Добавить("Имя");
			    ПараметрыРевизии.Колонки.Добавить("Свойство");
			    ПараметрыРевизии.Колонки.Добавить("Значение");
				ПараметрыРевизии.Колонки.Добавить("ЕдиницаИзмерения");
			    ПараметрыРевизии.Колонки.Добавить("Наследовать");
				
				Для j=0 По Ревизия.Параметры.Количество()-1 Цикл 
			    	Строка=ПараметрыРевизии.Добавить();
			    	Строка.Параметр = Ревизия.Параметры[j].Параметр;
				    Строка.Имя   	= Ревизия.Параметры[j].Параметр.Наименование;
				    Строка.Свойство = Ревизия.Параметры[j].Параметр.Свойство;
				    Строка.Значение = Ревизия.Параметры[j].Параметр.Значение;
				    Строка.Наследовать=Ложь;
			    КонецЦикла;
				
				
				Строка=ПараметрыРевизии.Найти(ПланыВидовХарактеристик.plm_Свойства.СпособСозданияРевизии,"Свойство");
	    		Если Строка=Неопределено Тогда
					Строка = ПараметрыРевизии.Добавить();
				    Строка.Имя		= ПланыВидовХарактеристик.plm_Свойства.СпособСозданияРевизии.Наименование;
				    Строка.Свойство = ПланыВидовХарактеристик.plm_Свойства.СпособСозданияРевизии;
				    Строка.Значение = Справочники.plm_СпособыСозданияРевизий.Исполнение;
				КонецЕсли;
				
				Строка=ПараметрыРевизии.Найти(ПланыВидовХарактеристик.plm_Свойства.НомерИсполнения,"Свойство");
	   			Если Строка=Неопределено Тогда 
			    	Строка = ПараметрыРевизии.Добавить();
					Строка.Имя		= ПланыВидовХарактеристик.plm_Свойства.НомерИсполнения.Наименование;
					Строка.Свойство = ПланыВидовХарактеристик.plm_Свойства.НомерИсполнения;
					Строка.Значение = НомерИсполнения;
				КонецЕсли;
				
				Если ОригиналРевизии.Ссылка <> Ревизия.Ссылка Тогда 
					локПредыдущаяРевизия = Ревизия.ПредыдущаяРевизия;
					Обработки.plm_СозданиеРевизий.plm_СвязатьРевизии(ОригиналРевизии, Ревизия, ПараметрыРевизии);
					
					ОбъектРевизии = Ревизия.ПолучитьОбъект();
					Если ЗначениеЗаполнено(локПредыдущаяРевизия) И локПредыдущаяРевизия.ОригиналРевизии = ОригиналРевизии Тогда 
						ОбъектРевизии.ПредыдущаяРевизия = локПредыдущаяРевизия;
					КонецЕсли;
					
					Обработки.plm_СозданиеОбъектов.plm_УстановкаПараметра(ОбъектРевизии, ПланыВидовХарактеристик.plm_Свойства.Обозначение, ОбозначениеОригинала);
					
					//МодульСозданияОбъектов.plm_СоздатьПредставление(ОбъектРевизии);
					Если ЗначениеЗаполнено(plm_ВспомНайтиПараметрПоСвойству(ОбъектРевизии, ПланыВидовХарактеристик.plm_Свойства.НомерИсполнения).Значение) Тогда 
						plm_СоздатьПредставлениеРевизии2(ОбъектРевизии, Справочники.plm_СпособыСозданияРевизий.Исполнение);
					КонецЕсли;
					Если ЗначениеЗаполнено(plm_ВспомНайтиПараметрПоСвойству(ОбъектРевизии, ПланыВидовХарактеристик.plm_Свойства.НомерРевизии).Значение) Тогда 
						plm_СоздатьПредставлениеРевизии2(ОбъектРевизии, Справочники.plm_СпособыСозданияРевизий.Изменение);
					КонецЕсли;
					ОбъектРевизии.ДополнительныеСвойства.Вставить("ПроверитьУникальность", Ложь);
					ОбъектРевизии.Записать();
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
КонецПроцедуры

// Процедура создает представление ревизии в зависимости от способа создания
// Параметры:
// 		itemRevision - CправочникОбъект.plm_ЭлементыСтруктуры
&НаСервере
Процедура plm_СоздатьПредставлениеРевизии2( itemRevision, СпособСоздания ) 
	ПараметрНомерРевизии	= plm_ВспомНайтиПараметрПоСвойству(itemRevision, ПланыВидовХарактеристик.plm_Свойства.НомерРевизии);
	ПараметрНомерИсполнения	= plm_ВспомНайтиПараметрПоСвойству(itemRevision, ПланыВидовХарактеристик.plm_Свойства.НомерИсполнения);
	
	i = 0;
	Пока i < itemRevision.ПредставлениеЭлемента.Количество() Цикл 
		СтрокаПредставления = itemRevision.ПредставлениеЭлемента[i];
		Если СпособСоздания = Справочники.plm_СпособыСозданияРевизий.Изменение И СтрокаПредставления.Системный = 1 Тогда 
			// Удалить системные параметры ревизии изменения (=1) из представления
			itemRevision.ПредставлениеЭлемента.Удалить(i);
		ИначеЕсли СпособСоздания <> Справочники.plm_СпособыСозданияРевизий.Изменение И СтрокаПредставления.Системный > 0 Тогда 
			// Удалить все системные параметры (>0) из представления
			itemRevision.ПредставлениеЭлемента.Удалить(i);
		Иначе 
			i = i + 1;
		КонецЕсли;
	КонецЦикла;
	

	// Системный: 1 - ревизия изменения, 2 - ревизия исполнения
	Если СпособСоздания = Справочники.plm_СпособыСозданияРевизий.Изменение Тогда 
		// номер изменения в конец представления
		СтрокаПредставления = itemRevision.ПредставлениеЭлемента.Добавить();
		СтрокаПредставления.Параметр  = "/";
		СтрокаПредставления.Системный = 1;
		
		Если ЗначениеЗаполнено(ПараметрНомерРевизии) Тогда 
			СтрокаПредставления = itemRevision.ПредставлениеЭлемента.Добавить();
			СтрокаПредставления.Параметр  = ПараметрНомерРевизии;
			СтрокаПредставления.Системный = 1;
		КонецЕсли;
		
	ИначеЕсли СпособСоздания = Справочники.plm_СпособыСозданияРевизий.Исполнение Тогда 
		ПозВставки = Неопределено;
		ПараметрОбозначение = plm_ВспомНайтиПараметрПоСвойствуВПредставлении(itemRevision, ПланыВидовХарактеристик.plm_Свойства.Обозначение);
		Если ЗначениеЗаполнено(ПараметрОбозначение) Тогда 
			ПозВставки = itemRevision.ПредставлениеЭлемента.Индекс(itemRevision.ПредставлениеЭлемента.Найти(ПараметрОбозначение)) ;
		КонецЕсли;
		
		// номер исполнения после обозначения
		Если ПозВставки <> Неопределено Тогда 
			ПозВставки=ПозВставки+1;
			СтрокаПредставления = itemRevision.ПредставлениеЭлемента.Вставить(ПозВставки);
		Иначе 
			СтрокаПредставления = itemRevision.ПредставлениеЭлемента.Добавить();
		КонецЕсли;
		СтрокаПредставления.Параметр  = "-";
		СтрокаПредставления.Системный = 2;
		
		Если ЗначениеЗаполнено(ПараметрНомерИсполнения) Тогда 
			Если ПозВставки <> Неопределено Тогда 
				ПозВставки=ПозВставки+1;
				СтрокаПредставления = itemRevision.ПредставлениеЭлемента.Вставить(ПозВставки);
			Иначе 
				СтрокаПредставления = itemRevision.ПредставлениеЭлемента.Добавить();
			КонецЕсли;
			СтрокаПредставления.Параметр  = ПараметрНомерИсполнения;
			СтрокаПредставления.Системный = 2;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
